nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso51u68/common/pin_mux/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#define PIO023_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO023_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO024_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO024_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */

/*! @name FC1_RTS_SCL_SSEL1 (number 1), J4[9]/JS3[1]/JS4[3]/U10[7]/U12[D6]/BRIDGE_SCL */
#define BOARD_LINK2MCU_SCL_PORT                                               0U   /*!<@brief PORT device index: 0 */
#define BOARD_LINK2MCU_SCL_PIN                                               23U   /*!<@brief PORT pin number */
#define BOARD_LINK2MCU_SCL_PIN_MASK                                  (1U << 23U)   /*!<@brief PORT pin mask */

/*! @name FC1_CTS_SDA_SSEL0 (number 2), J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP */
#define BOARD_LINK2MCU_SDA_PORT                                               0U   /*!<@brief PORT device index: 0 */
#define BOARD_LINK2MCU_SDA_PIN                                               24U   /*!<@brief PORT pin number */
#define BOARD_LINK2MCU_SDA_PIN_MASK                                  (1U << 24U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLink2MCUPins(void); /* Function assigned for the Cortex-M0P */

#define PIO024_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO031_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO031_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO04_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT0                                                    0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_24 (number 2), J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP */

/* Symbols to be used with GPIO driver */
#define BOARD_SW1_GPIO                                                      GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW1_GPIO_PIN_MASK                                      (1U << 24U)   /*!<@brief GPIO pin mask */
#define BOARD_SW1_PORT                                                        0U   /*!<@brief PORT device index: 0 */
#define BOARD_SW1_PIN                                                        24U   /*!<@brief PORT pin number */
#define BOARD_SW1_PIN_MASK                                           (1U << 24U)   /*!<@brief PORT pin mask */

/*! @name PIO0_31 (number 13), J2[17]/J3[2]/P1[7]/U3[4]/SW2/P0_31-PDM0_CLK-ISP0_EN */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO                                                      GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN_MASK                                      (1U << 31U)   /*!<@brief GPIO pin mask */
#define BOARD_SW2_PORT                                                        0U   /*!<@brief PORT device index: 0 */
#define BOARD_SW2_PIN                                                        31U   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK                                           (1U << 31U)   /*!<@brief PORT pin mask */

/*! @name PIO0_4 (number 38), J4[7]/U9[12]/SW3/BRIDGE_T_INTR-ISP1 */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_GPIO                                                      GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK                                       (1U << 4U)   /*!<@brief GPIO pin mask */
#define BOARD_SW3_PORT                                                        0U   /*!<@brief PORT device index: 0 */
#define BOARD_SW3_PIN                                                         4U   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK                                            (1U << 4U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M0P */

#define PIO029_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO110_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO110_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO19_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO19_FUNC_ALT0                                                    0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO1_9 (number 29), J9[5]/D2[3]/P1_9-BLUE_LED */

