nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso51u68/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LED_BLUE_GPIO                                                 GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO_PIN_MASK                                  (1U << 9U)   /*!<@brief GPIO pin mask */
#define BOARD_LED_BLUE_PORT                                                   1U   /*!<@brief PORT device index: 1 */
#define BOARD_LED_BLUE_PIN                                                    9U   /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK                                       (1U << 9U)   /*!<@brief PORT pin mask */

/*! @name PIO1_10 (number 30), J9[8]/D2[4]/P1_10-SCT4-LED_GREEN */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_GREEN_GPIO                                                GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_GREEN_GPIO_PIN_MASK                                (1U << 10U)   /*!<@brief GPIO pin mask */
#define BOARD_LED_GREEN_PORT                                                  1U   /*!<@brief PORT device index: 1 */
#define BOARD_LED_GREEN_PIN                                                  10U   /*!<@brief PORT pin number */
#define BOARD_LED_GREEN_PIN_MASK                                     (1U << 10U)   /*!<@brief PORT pin mask */

/*! @name PIO0_29 (number 11), J2[5]/D2[1]/P0_29-CT32B0_MAT3-RED */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_RED_GPIO                                                  GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_RED_GPIO_PIN_MASK                                  (1U << 29U)   /*!<@brief GPIO pin mask */
#define BOARD_LED_RED_PORT                                                    0U   /*!<@brief PORT device index: 0 */
#define BOARD_LED_RED_PIN                                                    29U   /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK                                       (1U << 29U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M0P */

#define PIO025_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO025_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO026_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO026_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */

/*! @name FC4_RTS_SCL_SSEL1 (number 3), J1[1]/JS4[1]/U10[7]/P0_25-FC4_SCLX */
#define BOARD_FC4_SCLX_PORT                                                   0U   /*!<@brief PORT device index: 0 */
#define BOARD_FC4_SCLX_PIN                                                   25U   /*!<@brief PORT pin number */
#define BOARD_FC4_SCLX_PIN_MASK                                      (1U << 25U)   /*!<@brief PORT pin mask */

/*! @name FC4_CTS_SDA_SSEL0 (number 4), J1[3]/JS5[1]/U10[5]/P0_26-FC4_SDAX */
#define BOARD_FC4_SDAX_PORT                                                   0U   /*!<@brief PORT device index: 0 */
#define BOARD_FC4_SDAX_PIN                                                   26U   /*!<@brief PORT pin number */
#define BOARD_FC4_SDAX_PIN_MASK                                      (1U << 26U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSecureMCUPins(void); /* Function assigned for the Cortex-M0P */

#define PIO018_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO018_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO019_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO019_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO020_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO020_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO12_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_FUNC_ALT4                                                    0x04u   /*!<@brief Selects pin function.: Alternative connection 4. */

/*! @name FC5_TXD_SCL_MISO (number 58), J1[11]/U5[2]/P0_18-FC5_TXD_SCL_MISO */
#define BOARD_SPI_FLASH_MISO_PORT                                             0U   /*!<@brief PORT device index: 0 */
#define BOARD_SPI_FLASH_MISO_PIN                                             18U   /*!<@brief PORT pin number */
#define BOARD_SPI_FLASH_MISO_PIN_MASK                                (1U << 18U)   /*!<@brief PORT pin mask */

/*! @name FC5_SCK (number 59), J1[9]/J2[8]/U5[6]/P0_19-FC5_SCK-SPIFI_CSn */
#define BOARD_SPI_FLASH_SCK_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_SPI_FLASH_SCK_PIN                                              19U   /*!<@brief PORT pin number */
#define BOARD_SPI_FLASH_SCK_PIN_MASK                                 (1U << 19U)   /*!<@brief PORT pin mask */

/*! @name FC5_RXD_SDA_MOSI (number 60), J1[13]/U5[5]/P0_20-FC5_RXD_SDA_MOSI */
#define BOARD_SPI_FLASH_MOSI_PORT                                             0U   /*!<@brief PORT device index: 0 */
#define BOARD_SPI_FLASH_MOSI_PIN                                             20U   /*!<@brief PORT pin number */
#define BOARD_SPI_FLASH_MOSI_PIN_MASK                                (1U << 20U)   /*!<@brief PORT pin mask */

/*! @name FC5_SSEL3 (number 16), J9[7]/JS8[1]/U5[1]/P1_2-FC5_SSEL3 */
#define BOARD_FC5_SSEL3_PORT                                                  1U   /*!<@brief PORT device index: 1 */
#define BOARD_FC5_SSEL3_PIN                                                   2U   /*!<@brief PORT pin number */
#define BOARD_FC5_SSEL3_PIN_MASK                                      (1U << 2U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI_FLASHPins(void); /* Function assigned for the Cortex-M0P */

#define PIO011_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO012_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO013_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO014_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO022_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO022_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO023_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO023_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO024_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO024_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO04_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT0                                                    0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_4 (number 38), J4[7]/U9[12]/SW3/BRIDGE_T_INTR-ISP1 */

