nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso51u68/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_GPIO                GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_GPIO_PIN_MASK (1U << 4U)   /*!<@brief GPIO pin mask */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_PORT                  0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_PIN                   4U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_PIN_MASK      (1U << 4U)   /*!<@brief PORT pin mask */

/*! @name FC3_SCK (number 46), J4[4]/U9[13]/BRIDGE_T_SCK */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_SCK_PORT                   0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_SCK_PIN                   11U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_SCK_PIN_MASK      (1U << 11U)   /*!<@brief PORT pin mask */

/*! @name FC3_RXD_SDA_MOSI (number 47), J4[2]/U9[11]/BRIDGE_T_MOSI */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_MOSI_PORT                  0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_MOSI_PIN                  12U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_MOSI_PIN_MASK     (1U << 12U)   /*!<@brief PORT pin mask */

/*! @name FC3_TXD_SCL_MISO (number 48), J4[3]/U15[4]/BRIDGE_T_MISO */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_MISO_PORT                  0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_MISO_PIN                  13U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_MISO_PIN_MASK     (1U << 13U)   /*!<@brief PORT pin mask */

/*! @name FC3_CTS_SDA_SSEL0 (number 49), J2[12]/J4[1]/U9[14]/BRIDGE_T_SSEL-SPIFI_IO3 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_SSEL_PORT                  0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_SSEL_PIN                  14U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_SSEL_PIN_MASK     (1U << 14U)   /*!<@brief PORT pin mask */

/*! @name PIO0_22 (number 63), J4[8]/P0_22-BRIDGE_GPIO */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_GPIO                  GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_GPIO_PIN_MASK  (1U << 22U)   /*!<@brief GPIO pin mask */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_PORT                    0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_PIN                    22U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_PIN_MASK       (1U << 22U)   /*!<@brief PORT pin mask */

/*! @name FC1_RTS_SCL_SSEL1 (number 1), J4[9]/JS3[1]/JS4[3]/U10[7]/U12[D6]/BRIDGE_SCL */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PORT                     0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PIN                     23U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PIN_MASK        (1U << 23U)   /*!<@brief PORT pin mask */

/*! @name FC1_CTS_SDA_SSEL0 (number 2), J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PORT              0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PIN              24U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PIN_MASK (1U << 24U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMod_SPI_I2C_BRIDGEPins(void); /* Function assigned for the Cortex-M0P */

#define PIO16_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO16_FUNC_ALT7                                                    0x07u   /*!<@brief Selects pin function.: Alternative connection 7. */

/*! @name USB0_DP (number 5), J5[3]/U7[2]/USB_DP */

/*! @name USB0_DM (number 6), J5[2]/U7[3]/USB_DM */

/*! @name USB0_VBUS (number 26), J1[14]/J5[1]/JP10[2]/P1_6-FC7_SCK-USB_VBUS */
#define BOARD_USB_VBUS_PORT                                                   1U   /*!<@brief PORT device index: 1 */
#define BOARD_USB_VBUS_PIN                                                    6U   /*!<@brief PORT pin number */
#define BOARD_USB_VBUS_PIN_MASK                                       (1U << 6U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M0P */

#define PIO00_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO00_FUNC_ALT1                                                    0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO01_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO01_FUNC_ALT1                                                    0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name FC0_TXD_SCL_MISO (number 32), U6[4]/U22[3]/P0_1-ISP_TX */
#define BOARD_DEBUG_UART_TX_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_TX_PIN                                               1U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK                                  (1U << 1U)   /*!<@brief PORT pin mask */

/*! @name FC0_RXD_SDA_MOSI (number 31), U18[4]/TO_MUX_P0_0-ISP_RX */
#define BOARD_DEBUG_UART_RX_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_RX_PIN                                               0U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK                                  (1U << 0U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M0P */

#define PIO016_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO016_FUNC_ALT5                                                   0x05u   /*!<@brief Selects pin function.: Alternative connection 5. */
#define PIO017_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO017_FUNC_ALT5                                                   0x05u   /*!<@brief Selects pin function.: Alternative connection 5. */

/*! @name SWDIO (number 53), J2[6]/P1[2]/U2[5]/U14[4]/IF_TMS_SWDIO-SPIFI_IO0 */
#define BOARD_DEBUG_SWD_SWDIO_PORT                                            0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_SWD_SWDIO_PIN                                            17U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_SWD_SWDIO_PIN_MASK                               (1U << 17U)   /*!<@brief PORT pin mask */

/*! @name SWCLK (number 52), J2[4]/JS28/U4[4]/TCK-SWDCLK_TRGT-SPIFI_IO1 */
#define BOARD_DEBUG_SWD_SWDCLK_PORT                                           0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_SWD_SWDCLK_PIN                                           16U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_SWD_SWDCLK_PIN_MASK                              (1U << 16U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
